/*
    1. შემოგვდის რიცხვი. შექმენით შემოსული რიცხვების ტოლი ორი მასივი.
    ორივე შეავსეთ რაღაც ელემენტებით.
    ⁃ შეამოწმეთ:
    ⁃ ეს ორი მასივი ტოლია თუ არა (ანუ ზუსტად იგივე თანმიმდევრობით
    იგივე ელემენტების არის თუ არა შევსებული)
    ⁃ მაგალითად:
    ⁃ მასივი {1, 2, 3} და მასივი {1, 2, 3} ტოლია.
    ⁃ მასივი {1, 2, 3} და მასივი {1, 3, 2} არ არის ტოლია.
    ⁃ მასივი {1, 2, 3} და მასივი {4, 5} არ არის ტოლია.
    ⁃ შემდეგ დაბეჭდეთ ამ მასივების საერთო ელემენტები
    ⁃ მაგალითად:
    ⁃ {1, 2, 3, 4} და {2, 3, 5, 6} მასივებს საერთო ექნებოდათ 2 და 3.
    2. დაწერეთ პროგრამა, რომელიც გამოიტანს მასივში მეორე ყველაზე დიდ
    რიცხვს. მაგალითად, მასივში {3, 2, 1 4} პასუხი იქნებოდა 3. რადგან
    მაქსიმალური რიცხვი არის 4 და მაგის შემდეგ ყველაზე დიდი რიცხვი
    არის 3. მასივი შეგიძლიათ ხელით კოდშივე (hard-coded) შეავსოთ.
    აუცილებელი არ არის რომ მისი ზომა და ელემენტები კონსოლიდან
    შეიყვანოთ (როგორც წინა ამოცანაში).
 */

public class Hmwrk12 {
    public static void main(String[] args) {

    }

    private static void secondBiggest(){
       int largest = 0;
       int secondLargest = 0;
       int[] arr = {6,5,2,7,19,20,44};
       for (int i = 0; i < arr.length; i++){
           if (arr[i] > largest){
               secondLargest = largest;
               largest = arr[i];
           }
       }
    }

}
